# Velocity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePressureDropData..::..Velocity Property
PipePressureDropData Class See Also
---
The velocity of the pipe. Units: (ft/s) .
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Velocity { get; set; }
```

Visual Basic
---
```text
Public Property Velocity As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Velocity {
	double get ();
	void set (double value);
}
```

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace